app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if artist = Artist.find_by(id: params[:artist_id])
        @songs = artist.songs
      else
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? ORDER BY "artists"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? LIMIT ?  [["artist_id", 5], ["LIMIT", 1]]

  def show
    #binding.pry
    if params[:artist_id] && artist = Artist.find(params[:artist_id])
    # binding.pry
      if song = artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? ORDER BY "songs"."id" ASC LIMIT ?  [["artist_id", 5], ["id", 7], ["LIMIT", 1]]